<script lang="ts">
  import Section from "./section.svelte";
</script>

<Section title="Greeting" subTitle="開催にあたって" id="greeting">
  <div class="">
    <div class="scroll-up space-y-4">
      <p>
        「あなたがすることのほとんどは無意味であるが、それでもしなくてはならない。そうしたことをするのは、世界を変えるためではなく、世界によって自分が変えられないようにするためである。」インド独立の父、マハトマ・ガンジーの言葉である。
      </p>
      <p>
        デザインは社会的な営みである。時には困難な課題を解決し、またある時には全く新しい価値観を生み出すことがある。いずれもそのことによって世界は変わり、よりよい社会を育む一助となることをデザインの役割として誰もが期待している。
      </p>
      <p>
        学生の卒業制作や研究の成果はそうした役割を担うための第一歩である。もちろんこれらによって世界が突然変わったりすることはないだろうが、それぞれが心に秘めたものはきっとあることと思う。
        この一歩が世界のためではなく、自分が確かにここにいて、考えて、生きた、その証としてこの経験がそれぞれの人生で意味あるものになってゆくだろう。
      </p>
      <p>
        先行きが不透明な世界と言われるが、恐れずむしろ新たな価値観を社会に提案し、その価値を確かめていく勇気と心構えを携えていく彼らの旅の始まりを言祝ぐ機会になればと思う。
      </p>
    </div>
    <div
      class="scroll-up mt-4 flex items-center justify-start space-x-4 md:justify-end"
    >
      <img
        src="./greeting-teacher-img.png"
        alt="学類長のご尊顔"
        class="h-24 w-24"
      />
      <div class="text-center">
        <p>価値創造デザイン学類長</p>
        <p>土岐謙次 教授</p>
      </div>
    </div>
  </div>
</Section>
