<script lang="ts">
  import Section from "./section.svelte";
</script>

<Section title="Greeting" subTitle="開催にあたって" id="greeting">
  <div class="">
    <div class="scroll_up space-y-4">
      <p>
        かつてワルター・グロピウスが「旅する建築家として私の心にまず浮かぶのは、芸術家・建築家・プランナーは、新しい文化に何を貢献しうるかという疑問であった。」と言ったように、デザイナーは新たなモノや価値を生み出す職能として理解されているが、過去の文化を更新してゆくことでしか新しい文化に到達しえないのだとすれば、ここに発表された数々の学生たちの試みはデザインとしての本質を十分に踏まえたものだと言えるのではないだろうか。
      </p>
      <p>
        グロピウスは続ける。「最も大切だと思われることは、あらゆるデザイナーが自分の個人的なデザインについて、全体のなかで果たす役割を考えることである。」と。卒業制作では学生が個々に社会での役割を「想定」し、できる限りの提案をするが、これからは実際の社会で、大学で取り組む課題では直面しえない、想定を上回る場面の連続に直面することになるだろう。
      </p>
      <p>
        折しも昨年来のコロナ禍で世界はこれまでの価値観では対応できないことが増えている。恐れずむしろ新たな価値観を社会に提案し、その価値を確かめていく勇気と心構えを携えていく彼らの旅の始まりを言祝ぐ機会になればと思う。
      </p>
    </div>
    <div
      class="scroll_up mt-4 flex items-center justify-start space-x-4 md:justify-end"
    >
      <img
        src="./greeting-teacher-img.png"
        alt="学類長のご尊顔"
        class="h-24 w-24"
      />
      <div class="text-center">
        <p>価値創造デザイン学類長</p>
        <p>土岐謙次 教授</p>
      </div>
    </div>
  </div>
</Section>
